# ExportLinetypeInfo Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLinetypeInfo Properties
ExportLinetypeInfo Class See Also
---
The ExportLinetypeInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DestinationLinetypeName | The destination linetype name (the name of the linetype in the exported format). |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExportLinetypeInfo Class
Autodesk.Revit.DB Namespace